[
    {
        "title": "Atomic Habits",
        "author": "James Clear",
        "url": "https://amzn.to/35YJ9DS",
        "description": "Excellent book for those who want to learn how to form good habits easily or break bad ones. Also, its 1% compounding effect  description is amazing, inspirational and motivational.",
        "recommendationYear": 2019
    },
    {
        "title": "Why We Sleep",
        "author": "Matthew Walker",
        "url": "https://amzn.to/2FVWcLt",
        "description": "Highly recommended book to gain insights into sleep and its value. You'll re-think late night alcohol beverages, Netflix binges and staring at screens :) Somewhat disturbing facts which some articles already disproved so take everything with a grain of salt (or two).",
        "recommendationYear": 2019
    },
    {
        "title": "Sapiens: A brief history of humankind",
        "author": "Yuval Noah Harari",
        "url": "https://amzn.to/38etG3V",
        "description": "Interesting take on history of the world in which history and philosophy mix to create tantalizing read.",
        "recommendationYear": 2019
    }, {
        "title": "Radical Candor: Be a Kick-ass Boss Without Losing Your Humanity",
        "author": "Kim Scott",
        "url": "https://amzn.to/33XzwWk",
        "description": "Whether you are a boss, or have one you need to read this book. Its simple framework of challenging directly and caring personally is really powerful. I've thought I was being radically candor when I was obnoxuiously aggressive and by reading this amazing book I now know the difference and how to progress from undesired behaviour to desired one.",
        "recommendationYear": 2020
    }, {
        "title": "Anything You Want: 40 Lessons for a New Kind of Entrepreneur",
        "author": "Derek Sivers",
        "url": "https://amzn.to/3fFlNZe",
        "description": "This short book (which if you put your mind to it can be read in a couple of hours) is so filled with great advice that I implore you to read it multiple times. Derek Sivers, the creator of CD Baby is describing his success and his failures in a series of short lessons where each one has a great takeaway. Some of the best quotes for me are \"Success comes from persistently improving and inventing, not from persistently doing what's not working\" and \"No 'yes'. Either 'Hell yeah!' or 'no.'\"",
        "recommendationYear": 2020
    }, {
        "title": "Never Split The Difference: Negotiating As If Your Life Depended On It",
        "author": "Chris Voss",
        "url": "https://www.amazon.com/Never-Split-Difference-Negotiating-Depended/dp/0062407805",
        "description": "One of the best books on the subject of negotiation with a lot of examples of how to use the knowledge in your daily life. Not just for negotiating hostage situations. I've been using some of the tips when I'm 'negotiating' dinner plans with my girlfriend and so far I've been 100% successful :-)",
        "recommendationYear": 2020
    }, {
        "title": "Tiny Habits: The Small Changes That Change Everything",
        "author": "BJ Fogg",
        "url": "https://www.amazon.com/Tiny-Habits-Changes-Change-Everything/dp/0358003326",
        "description": "As I've read the Atomic Habits by James Clear earlier, I was aware of the importance of starting small but, I just wasn't aware how small (or tiny) can you go. The principle of B = MAP (behavior = motivation * ability * prompt) is explained in several ways in the book and the methods accompanying it are brilliant. There are 300 tiny habits and the end of the book to get inspired with and, they are very useful.",
        "recommendationYear": 2020
    }, {
        "title": "Influence: The Psychology of Persuassion",
        "author": "Robert B. Cialdini",
        "url": "https://amzn.to/2C93VYd",
        "description": "I'd recommend it to anyone interested in influencing and persuading people to say yes. Principles explained in the book are not that unknown but are explained in detail. Explained how and why they work and are accompanied with great examples.",
        "recommendationYear": 2020
    }, {
        "title": "Shoe Dog: A Memoir by the Creator of NIKE",
        "author": "Phil Knight",
        "url": "https://www.amazon.com/gp/product/1501135910/",
        "description": "Everybody and their grandma keep recommending this book. Both friends and influencers whose recommendation I usually like so I felt compelled to read it. To be frank I don't get what the fuss with this book is all about. There are definitely better biography / memoir books out there. Almost no mentioning of Jordan, Kobe or Tiger. Most of the book is focused on 'ancient' history when they were only re-selling other brands. I don't regret reading the book but nothing more than that.",
        "recommendationYear": 2020
    }, {
        "title": "How to Live: 27 conflicting answers and one weird conclusion",
        "author": "Derek Sivers",
        "url": "https://www.goodreads.com/book/show/58188742-how-to-live/",
        "description": "Extremely short book that you'll gulp down in one sitting. Each chapter/answer contradicts with one another which forces you to think really hard how to process it and adjust the ideas to fit within your context. And this is what it makes this book so amazing! My favourite chapter is definitely \"Make a million mistakes\".",
        "recommendationYear": 2021
    }, {
        "title": "Flow: The Psychology of Optimal Experience",
        "author": "Mihaly Csikszentmihalyi",
        "url": "https://www.amazon.com/Flow-Psychology-Experience-Perennial-Classics/dp/0061339202",
        "description": "The book was highly recommended by a lot of people and after reading it failed to grasp why. Maybe I couldn't get in its flow and couldn't appreciate it? :-) The book isn't bad, but I didn't find anything new that I haven't learned already. Perhaps it was such a big and worthy idea that many authors were inspired by. Maybe I've just started reading it too late.",
        "recommendationYear": 2021
    }, {
        "title": "The Dark Forest",
        "author": "Liu Cixin",
        "url": "https://www.goodreads.com/book/show/23168817-the-dark-forest",
        "description": "The whole Three-Body triology is amazing and definitely worth reading and one of the better SF series in my opinion. \"The Dark Forest\" (second book in the series) contains one of the most memorable definition of love: \"For the majority of people, what they love exists only in the imagination. The object of their love is not the man or woman of reality, but what he or she is like in their imagination. The person in reality is just a template used for the creation of this dream lover. Eventually, they find out the differences between their dream lover and the template. If they can get used to those differences, then they can be together. If not, they split up. It's as simple as that.\"",
        "recommendationYear": 2021
    }, {
        "title": "The Courage to Be Disliked: How to Free Yourself, Change your Life and Achieve Real Happiness",
        "author": "Ichiro Kishimi and Fumitake Koga",
        "url": "https://www.goodreads.com/book/show/43306206-the-courage-to-be-disliked",
        "description": "This book is being called \"Marie Condo for your brain\" and I find this comparison very suitable :-) Two thoughts really resonated with me. The first one is \"freedom is being disliked by other people\" and the other is \"happines is the feeling of contribution\". So simple yet so deep.",
        "recommendationYear": 2019
    }
]