[
    {
        "title": "The Joe Rogan Experience #1309 with Naval Ravikant",
        "url": "http://podcasts.joerogan.net/podcasts/naval-ravikant",
        "description": "If you're not familiar with Naval Ravikant stop with what you're doing immediately and go listen to him being interviewed by a Joe Rogan on his podcast. It's 2 hours long but well worth it. Too many wisdom bits from Naval too summarise here.",
        "recommendationYear": 2019
    },
    {
        "title": "How I Built This with Alexis Ohanian and Steve Huffman (of Reddit fame)",
        "url": "https://www.npr.org/2017/10/03/545635014/live-episode-reddit-alexis-ohanian-steve-huffman",
        "description": "Most of the HIBT episods are great but this one is special. Chemistry between Alexis and Steve exudes through headphones.",
        "recommendationYear": 2019
    },
    {
        "title": "The Tim Ferriss Show with Derek Sivers (of CD Baby fame)",
        "url": "https://tim.blog/2015/12/14/derek-sivers-on-developing-confidence-finding-happiness-and-saying-no-to-millions/",
        "description": "Tim Ferris is an amazing host and almost every episode is worth listening to but the one with Derek Sivers is pure gold.",
        "recommendationYear": 2019
    },
    {
        "title": "Full Stack Radio",
        "url": "http://www.fullstackradio.com/",
        "description": "Amazing podcasts for web developers where host Adam Wathan has awesome guests and asks all the right questions. I just can't single out any episode because all of them are interesing.",
        "recommendationYear": 2019
    },
    {
        "title": "The Knowledge Project Podcast #100 with Matt Mullenweg",
        "url": "https://fs.blog/knowledge-project/matt-mullenweg/",
        "description": "Most Farnam Street (The Knowledge Project) podcast episodes are awesome but the one with Matt Mullenweg from WordPress stands out for me. They discuss remote work (Matt rather calls it distributed) and different levels of it. Matt's saying \"Words create reality\" was something that moved me unexpectedly and was real food for thought. And I can not get over how soothing Matt Mullenweg voice sounds :-)",
        "recommendationYear": 2021
    },
    {
        "title": "The Knowledge Project Podcast #88 with Derek Sivers",
        "url": "https://fs.blog/knowledge-project/derek-sivers/",
        "description": "Derek Sivers is the bomb! He gives so many great nuggets here you'll have to listen to it at least twice. From his life philosophy, through book recommendations, to some intimate life details in a calm and rational matter. And all of this filled with jokes - he became minimalist because \"he had to move houses couple of times\" :-D",
        "recommendationYear": 2021
    },
    {
        "title": "The Tim Ferriss Show #547 with Balaji Srinivasan",
        "url": "https://tim.blog/2021/11/15/balaji-srinivasan-2/",
        "description": "Definitely the episode with the highest ratio of wisdom per minute :-) My mind was blown when I heard the idea of using Bitcoin mining as energy storage for wind and solar! And after you listen to this episode, make sure to check the previous Tim Ferris episode with Balaji.",
        "recommendationYear": 2021
    }
]